# NumDashStyles

## Description
Function NumDashStyles returns the number of available line dash patterns.

```pascal
FUNCTION NumDashStyles : INTEGER;
```

```python
def vs.NumDashStyles():
    return INTEGER
```

## Remarks
[[User:CBM-c-|_c_]], 2014.04.08:  It returns exclusively the count of dash styles ignoring complex line types, if any. Use [[VS:BuildResourceList]]  instead if you need them.

## Examples
==== VectorScript ====
```pascal
numLS := NumDashStyles;
```
==== Python ====
```python

```

## See Also
VS Functions:
BuildResourceList
| GetNameFromResourceList

## Version
Availability: from MiniCAD 4.0

## Category
* Document Attributes